cmsis-svd/cmsis-svd/data/Infineon/psoc4100sp.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN</name>
      <description>CAN Controller</description>
      <baseAddress>0x402E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INT_STATUS</name>
          <description>Interrupt Status</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFC</resetMask>
          <fields>
            <field>
              <name>ARB_LOSS</name>
              <description>The arbitration was lost while sending a message</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_LOAD</name>
              <description>An overload frame was received,
or reactive overload frame condition is detected (ISO-11898-1 section 10.11)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_ERR</name>
              <description>A bit error was detected</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STUFF_ERR</name>
              <description>A bit stuffing error was detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_ERR</name>
              <description>An CAN message acknowledge error was detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORM_ERR</name>
              <description>A CAN message format error was detected
please ignore this interrupt, when ERROR_STATUS.ERROR_STATE=2'B1x</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>A CAN CRC error was detected</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS_OFF</name>
              <description>The CAN has reached the bus off state</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MSG_LOSS</name>
              <description>when a new message arrives, but the RxMessage flag MSG_AV is set and LINK_FLAG is not set, RX_MSG_LOSS is set, and the new message is discarded.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MSG</name>
              <description>Indicates that a message was sent
0: Normal operation
1: A message was successfully sent from a transmit buffer
which has its TxIntEbl flag asserted.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MSG</name>
              <description>Indicates that a message was received
0: Normal operation
1: A new message was successfully received and stored in a receive
buffer which has its RxIntEBL flag asserted.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTR_MSG</name>
              <description>RTR auto-reply message sent
0: Normal operation
1: Indicates that a RTR auto-reply message was sent</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STUCK_AT_0</name>
              <description>Stuck at dominant error
0: Normal Operation
1: Indicates if the rx input remains stuack at 0 (dominant level) for
more than 16 consecutive bit times. 
The 'stuck at 0' condition is checked, only when COMMAND.RUN is set</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SST_FAILURE</name>
              <description>Single shot transmission failure
0: Normal operation
1: A buffer set for single shot transmission experienced
an arbitration loss or a bus error during transmission
The sst_failure interrupt  is set as well when the CAN controller is being stopped while an SST message is in the transmit buffer. user should transmit or remove respective SST messages before stopping the IP, to avoid triggering SST_FAILURE after writing COMMAND.RUN=0.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EBL</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFD</resetMask>
          <fields>
            <field>
              <name>GLOBAL_INT_ENBL</name>
              <description>global interrupt enable flag
'0': All interrupts are disabled
'1': Enabled interrupt sources are available</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_LOSS_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_LOAD_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_ERR_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STUFF_ERR_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_ERR_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORM_ERR_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_ERR_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS_OFF_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MSG_LOSS</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MSG_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MSG_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTR_MSG_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STUCK_AT_0_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SST_FAILURE_ENBL</name>
              <description>See description in INT_STATUS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFER_STATUS</name>
          <description>RxMessage and TxMessage Buffer Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX0_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX1_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX2_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX3_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX4_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX5_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX6_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX7_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX8_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX9_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX10_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX11_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX12_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX13_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX14_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX15_MSG_AV</name>
              <description>RxMessage Buffer Status</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX0_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX1_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX2_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX3_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX4_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX5_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX6_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX7_REQ_PEND</name>
              <description>TxMessage Buffer Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERROR_STATUS</name>
          <description>CAN Error Status</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_ERR_CNT</name>
              <description>The transmitter error counter according to the
CAN standard. When it is greater than 255,
it is fixed at 255</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_ERR_CNT</name>
              <description>The receive error counter according to the
CAN 2.0 specification. When in bus-off state,
this counter is used to count 128 groups of 11
recessive bits.
it is fixed at 255</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR_STATE</name>
              <description>The error state of the CAN node:
'00': error active (normal operation)
'01': error passive
'1x': bus off</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXGTE96</name>
              <description>The Tx error counter is greater or equal 96</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXGTE96</name>
              <description>The Rx error counter is greater or equal 96</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND</name>
          <description>CAN Command Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30000000</resetValue>
          <resetMask>0xFFFF000F</resetMask>
          <fields>
            <field>
              <name>RUN</name>
              <description>Run/Stop mode:
'0': Sets the CAN controller into stop mode.
Stop mode can be granted only in 'bus idle' field
Returns '0' when stopped.
'1': Sets the CAN controller into run mode.
Returns '1' when running.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LISTEN</name>
              <description>TEST_MODE[1]</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBACK_TEST</name>
              <description>TEST_MODE[2].
With TEST_MODE[2:1],
00: normal operation
01: Listen-only mode,
      The output is held at 'R' level. The CANmodule-III is only listening.
10: external loopback mode
11: internal loopback mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_TEST</name>
              <description>SRAM test mode
'0': Normal operation
'1': Enable SRAM test mode
it can be set, only when the IP is stopped (COMMAND.RUN=0, and really finished transition from run mode),
this mode will not be used, so it should never be set.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_REV_NUMBER</name>
              <description>IP Revision Number</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_MINOR_VERSION</name>
              <description>IP Minor Version Number</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_MAJOR_VERSION</name>
              <description>IP Major Version Number</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>CAN Configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>EDGE_MODE</name>
              <description>CAN bus synchronization logic
'0': Edge from 'R' to 'D' is used for synchronization
'1': Both edges are used
Note, only  'R' to 'D' edge shall be used for synchronization per ISO-11898-1 spec, so this bit should always be set 0 (by default)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLING_MODE</name>
              <description>CAN bus bit sampling
'0': One sampling point is used in the receiver
path
'1': 3 sampling points with majority decision are
used</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_SJW</name>
              <description>Synchronization jump width - 1
sjw &lt;= tseg1 and sjw &lt;=  tseg2</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTO_RESTART</name>
              <description>'0': After bus-off, the CAN core must be restarted by setting 
     COMMAND.RUN register. This is the recommended setting.
'1': After bus-off, the CAN core is restarting automatically 
     after 128 groups of 11 recessive bits</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG2</name>
              <description>Time segment 2
Length of the second time segment:
tseg2 = cfg_tseg2 + 1
cfg_tseg2=0 is not allowed; cfg_tseg2=1 is only
allowed in direct sampling mode.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_TSEG1</name>
              <description>Time segment 1
Length of the first time segment:
tseg1 = cfg_tseg1 + 1
Time segment 1 includes the propagation time.
cfg_tseg1=0 and cfg_tseg1=1 are not allowed.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ARBITER</name>
              <description>Transmit buffer arbiter
'0': Round robin arbitration
'1': Fixed priority arbitration</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP_ENDIAN</name>
              <description>Swap Endian - the byte position of the CAN receive and transmit data fields can be modified to match the endian setting of the processor or the used CAN protocol
0: CAN data byte position is not swapped (big endian)
1: CAN data byte position is swapped (little endian)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ECR_MODE</name>
              <description>Error Capture mode
0: Free running: The ECR register shows the current bit position within the CAN frame
1: Capture mode: The ecr register shows the bit position and type of the last captured CAN error.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_BITRATE</name>
              <description>Prescaler for generating the time quantum
which defines the TQ:
0: One time quantum equals 1 clock cycle
1: One time quantum equals 2 clock cycles
...
32767: One time quantum equals 32768 clock
cycles</description>
              <bitRange>[30:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
