cmsis-svd/cmsis-svd/data/Infineon/psoc4100sp.svd
        <register>
          <name>ECR</name>
          <description>Error Capture Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>ECR_STATUS</name>
              <description>ECR STATUS -
0: ECR register captured an error, or it is in free running mode
1: ECR register is armed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_TYPE</name>
              <description>Error type -
000 : Arbitration loss
001 : Bit Error
010 : Bit Stuffing Error
011 : Acknowledge Error
100 : Form Error
101 : CRC Error
Others : N/A</description>
              <bitRange>[3:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>RX Mode -
0: No status
1: CAN Controller is receiver</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>TX Mode -
0: No status
1: CAN Controller is transmitter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BIT</name>
              <description>Bit number inside of Field</description>
              <bitRange>[11:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>Field -
0x00 : Stopped
0x01 : Synchronize
0x05 : Interframe
0x06 : Bus Idle
0x07 : Start of Frame
0x08 : Arbitration
0x09 : Control
0x0A : Data
0x0B : CRC
0x0C : ACK
0x0D : End of frame
0x10 : Error flag
0x11 : Error echo
0x12 : Error delimiter
0x18 : Overload flag
0x19 : Overload echo
0x1A : Overload delimiter
Others : N/A</description>
              <bitRange>[16:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <name>TX[%s]</name>
          <description>TxMessage Buffer control/command</description>
          <addressOffset>0x00000020</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>TxMessage Buffer control/command</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>TX_REQ</name>
                <description>TxReq, Transmit Request
Write:
'0': idle
'1': Message Transmit Request5
Read:
'0': TxReq completed
'1': TxReq pending</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_ABORT</name>
                <description>Transmit Abort Request
'0': idle
'1': Requests removal of a pending message. 
The message is removed the next time an arbitration
loss happens or a CAN error is detected. 
The flag is cleared when the message was removed or when the
message won arbitration. 
The TxReq flag is released at the same time

when there is a pending TX message (read out TxReq=1 and TxAbort=0), Writing TxReq=1 and TxAbort=1 has no effect.

for SST message,when the message is aborted, the TxReq fag is cleared, but the TxAbort fag remains asserted.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_INT_EBL</name>
                <description>Tx Interrupt Enable
'0': Interrupt disabled
'1': Interrupt enabled, successful message transmission
sets the TxMsg</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WPNL</name>
                <description>N/A</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DLC</name>
                <description>DLC, Data Length Code
Invalid values are transmitted as they are, but the
number of data bytes is limited to eight.
0: Message has 0 data byte, data[63:0] is not used
1: Message has 1 data byte, data[63:56] is used
...
8: Message has 8 data bytes, data[63:0] is used
9-15: Message has 8 data bytes</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IDE</name>
                <description>Extended Identifier Bit
'0': This is a standard format message
'1': This is an extended format message</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RTR</name>
                <description>Remote Bit
'0': This is a standard message
'1': This is an RTR message</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WPNH</name>
                <description>N/A</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ID</name>
            <description>TxMessage Buffer Identifier</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Message identifier</description>
                <bitRange>[31:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_HIGH</name>
            <description>TxMessage Buffer Data high</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data[63:32]
when CONFIG.SWAP_ENDIAN=0(Big Endian, by default),
the sequence of DATA transmission is, 
{DATA_HIGH[31:0], DATA_LOW[31:0]}
if only byte is defined in CONTROL.DLC, DATA_HIGH[7:0] will be transmitted

when CONFIG.SWAP_ENDIAN=1(Little Endian),
the sequence of DATA transmission is, 
{DATA_HIGH[7:0], [15:8], [23:16], [31:24], DATA_LOW[7:0], [15:8], [23:16], [31:24]}
if only byte is defined in CONTROL.DLC, DATA_HIGH[7:0] will be transmitted</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_LOW</name>
            <description>TxMessageBuffer Data low</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data[31:0]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>16</dim>
          <dimIncrement>32</dimIncrement>
          <name>RX[%s]</name>
          <description>RxMessage buffer control/command</description>
          <addressOffset>0x000000A0</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>RxMessage Buffer control/command</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>MSG_AV_RTRSENT</name>
                <description>Msg Available/RTR Sent
If RTReply flag is set, this bit shows if an RTR auto-reply message has been sent, otherwise it indicates if the buffer contains a valid message.
Read: 
'0': Idle
'1': New message available (RTRreply=0), RTR auto-reply message sent (RTRreply=1).

Write:
'0': Idle
'1': Acknowledges receipt of new message or transmission of RTR auto-reply message.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RTR_REPLY_PEND</name>
                <description>RTReply_pending status
'0': No RTR reply request pending
'1': RTR reply request pending</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RTR_ABORT</name>
                <description>RTR Abort Request
'0': Idle
'1': Requests removal of a pending RTR message
reply. The flag is cleared when the message
was removed or when the message won arbitration.
The TxReq flag is released at the
same time.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUFFER_EN</name>
                <description>Buffer Enable
'0': Buffer is disabled
'1': Buffer is enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RTR_REPLY</name>
                <description>automatic message reply upon receipt
of an RTR message
'0': Automatic RTR message handling disabled
'1': Automatic RTR message handling enabled

when this bit is set, only RTR message can be received, by setting AMR.RTR=0, AMR.RTR=1.
Otherwise, the RTR reply message content will corrupted by received non-RTR message.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_INT_EBL</name>
                <description>RxIntEbl, Receive Interrupt Enable
'0': Interrupt generation is disabled
'1': Interrupt generation is enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LINK_FLAG</name>
                <description>Link Flag
'0': This buffer is not linked to the next
'1': This buffer is linked with next buffer</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WPNL</name>
                <description>N/A</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DLC</name>
                <description>DLC, Data Length Code
0: Message has 0 data bytes, data[63:0] is notvalid
1: Message has 1 data byte, data[63:56] is valid
..
8: Message has 8 data bytes, data[63:0] is valid
9-15: Message has 8 data bytes

