cmsis-svd/cmsis-svd/data/Infineon/psoc4100sp.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXCO</name>
      <description>ECO+PLL as SRSSLT clk_eco external source</description>
      <baseAddress>0x402F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_SELECT</name>
          <description>Clock Select Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CLK_SELECT</name>
              <description>When PLL_CONFIG.ENABLE=0, then clk_eco=clk_osc.
When PLL_CONFIG.ENABLE=1 then BYPASS_SEL and PLL_STATUS.LOCKED also affect this control point.
CLK_SELECT:
0:  PLL_CONFIG.BYPASS=0x, PLL_STATUS.LOCKED = 0:  clk_eco=clk_osc
     PLL_CONFIG.BYPASS=0x, PLL_STATUS.LOCKED = 1:  clk_eco=clk_pll
     PLL_CONFIG.BYPASS=10, PLL_STATUS.LOCKED = x:  clk_eco=clk_osc
     PLL_CONFIG.BYPASS=11, PLL_STATUS.LOCKED = x:  clk_eco=clk_pll
1:  PLL_CONFIG.BYPASS=xx, PLL_STATUS.LOCKED = x:  clk_eco=clk_pl</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_SEL</name>
              <description>Select source for PLL reference
0: from ECO
1: from external reference</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_CONFIG</name>
          <description>ECO Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Clock Enable.  When enabling the clock, first write ENABLE=1, wait at least 10us, and then write CLK_EN=1.  When disabling, clearing both CLK_EN=0 and ENABLE=0 can be done in the same AHB write</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_EN</name>
              <description>Automatic Gain Control (AGC) enable.  When set, the oscillation amplitude is controlled to the level selected by ECO_TRIM0.ATRIM.  When low, the amplitude is not explicitly controlled and will grow until it saturates to the supply rail (1.8V nom).  WARNING: use care when disabling AGC because driving a crystal beyond its rated limit can permanently damage the crystal.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for ECO oscillator.  Refer to CLK_EN for sequencing.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_STATUS</name>
          <description>ECO Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WATCHDOG_ERROR</name>
              <description>This bit is set to 1 if the oscillator is stuck.  The ECO clock is gated off during a watchdog error condition. Due to internal synchonization, the clock is stopped two cycles after an error condition is observed and ungated two cycles after the error condition is resolved.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CONFIG</name>
          <description>PLL Configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xC037FFFF</resetMask>
          <fields>
            <field>
              <name>FEEDBACK_DIV</name>
              <description>Control bits for feedback divider: Valid divide is 8-255.  Do not change while PLL output is selected.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFERENCE_DIV</name>
              <description>Control bits for reference divider: Divide by 2=0001, ..., divide by 64=111111.  Do not change while PLL output is selected.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_DIV</name>
              <description>Control bits for Output divider.  Do not change while PLL output is selected.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass Through</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICP_SEL</name>
              <description>Programmable charge pump current between 0uA and 7uA.  Do not change while the PLL output is selected.  For functional operation, the value must be set according to the PLL output frequency Fout (measured before the output divider):
0: 0uA (Hi-Z) Engineering use only
1: 1uA. Engineering use only
2: 2uA. Use when Fout &lt;= 67MHz
3: 3uA. Use when Fout &gt; 67MHz
4-7: 4uA-7uA.  Engineering use only</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_SEL</name>
              <description>Selects the source of the system PLL0 clock.  See also CLK_SELECT.CLK_SELECT for effect on clk_eco selection.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic using lock indicator.  When unlocked, automatically selects PLL reference input (bypass mode).  When locked, automatically selects PLL output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO1</name>
                  <description>Same as AUTO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_REF</name>
                  <description>Select PLL reference input (bypass mode).  Ignores lock indicator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_OUT</name>
                  <description>Select PLL output.  Ignores lock indicator.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOLATE_N</name>
              <description>Isolation control of PLL outputs.  This also internally resets the PLL.  De-assert &gt;= 5us after ENABLE=1.  Assertion can happen in same write as ENABLE=0.  Do not change while PLL output is selected.
0: Isolate outputs; Precharge PLL control voltage if PLL0_TEST.FAST_LOCK_EN is set to 1.
1: Do not isolate outputs</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for PLL power gate.  Refer to ISOLATE_N field for required sequencing.
0: Block is powered off, also forces clk_eco = clk_osc - See CLK_SELECT.CLK_SELECT description.
1: Block is powered on</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_STATUS</name>
          <description>PLL Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>PLL Lock Indicator - See CLK_SELECT.CLK_SELECT description for interaction with clk_eco selection.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_TEST</name>
          <description>PLL Test Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>TEST_MODE</name>
              <description>Test Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_VC_LKG</name>
                  <description>Vcontrol Leakage Test Mode
Measure frequency drift over time to indirectly measure leakage on Vcontrol</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_DN</name>
                  <description>Charge Pump Down Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=0 and ISOLATE_N=0, directly measure discharge current on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=1 and ISOLATE_N=0, directly measure precharge current on Vcontrol</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_UP</name>
                  <description>Charge Pump Up Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=0 and ISOLATE_N=0, directly measure discharge current on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=1 and ISOLATE_N=0, directly measure precharge current on Vcontrol</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_EXT_FL</name>
                  <description>User Mode with Extended Fast Lock Precharge</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_PQ</name>
                  <description>Reference and Feedback Counter Test Mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_LD_DLY</name>
                  <description>Lock Detector Delay Line Test Mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_ALT</name>
                  <description>Lock Detector Wait and Extended Fast Lock Counter Test Mode
With ICPSEL=0 and Reference Clock stopped directly measure precharge current on Vcontrol
With ICPSEL=0 and Reference Clock running directly measure leakage on Vcontrol</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_LOCK_EN</name>
              <description>Fast Lock Enable - Speeds up the lock time when set to 1.  When ISOLATE_N is high, the PLL control voltage will be precharged to reduce time spent acquiring frequency lock.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK_OCCURRED</name>
              <description>This bit sets whenever the PLL Lock bit goes low, and stays set until cleared by firmware. This is a diagnostic bit used for char and validation.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXCO_PGM_CLK</name>
          <description>EXCO Program Clock</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000001E</resetMask>
          <fields>
            <field>
              <name>CLK_ECO</name>
              <description>Bit bang clk_eco</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PLL0_IN</name>
              <description>Observation point for clk_pll0_in</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_PLL0_OUT</name>
              <description>Bit bang clk_pll0_out</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_PLL0</name>
              <description>Bit bang en_clk_pll0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable bit-banging test capability in this register.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM0</name>
          <description>ECO Trim0 Register</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>WDTRIM</name>
              <description>Watch Dog Trim -  Delta voltage below stead state level
0x0 - 0.05V
0x1 - 0.1V
0x2 - 0.15V
0x3 - 0.2V</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATRIM</name>
              <description>Amplitude trim to set the crystal drive level when ECO_CONFIG.AGC_EN=1.  WARNING: use care when setting this field because driving a crystal beyond its rated limit can permanently damage the crystal.
0x0 - 0.3Vpp
0x1 - 0.4Vpp
0x2 - 0.5Vpp
0x3 - 0.6Vpp
0x4 - 0.7Vpp
0x5 - 0.8Vpp
0x6 - 0.9Vpp
0x7 - 1.0Vpp</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM1</name>
          <description>ECO Trim1 Register</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x15</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>FTRIM</name>
              <description>Filter Trim - 3rd harmonic oscillation</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRIM</name>
              <description>Feedback resistor Trim</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GTRIM</name>
              <description>Gain Trim - Startup time</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM2</name>
          <description>ECO Trim2 Register</description>
          <addressOffset>0xFF08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>ITRIM</name>
              <description>Current Trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_TRIM</name>
          <description>PLL Trim Register</description>
          <addressOffset>0xFF0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>VCO_GAIN</name>
              <description>Programmable VCO frequency characteristic at high freq - set to &lt;10&gt;</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_WINDOW</name>
              <description>Selects the allowed phase error before declaring the PLL Unlocked</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_25NS</name>
                  <description>Delay 25 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_50NS</name>
                  <description>Delay 50 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_75NS</name>
                  <description>Delay 75 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_100NS</name>
                  <description>Delay 100 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DELAY</name>
              <description>Selects the number of PLL phase frequency detector cycles that the phase error must be in range before declaring lock. (PFD clock cycle = Clock Reference Period/REFERENCE_DIV)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFD_CLK_16</name>
                  <description>16 PFD clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_32</name>
                  <description>32 PFD clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_48</name>
                  <description>48 PFD clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_64</name>
                  <description>64 PFD clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
